Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.1.98/include/proc/p32mz1064daa288.h
extern volatile __DCS3CPTRbits_t DCS3CPTRbits __asm__ ("DCS3CPTR") __attribute__((section("sfrs"), address(0xBF811340)));
extern volatile uint32_t        DCH3CPTRCLR __attribute__((section("sfrs"),address(0xBF811344)));
extern volatile uint32_t        DCS3CPTRCLR __attribute__((section("sfrs"),address(0xBF811344)));
extern volatile uint32_t        DCH3CPTRSET __attribute__((section("sfrs"),address(0xBF811348)));
extern volatile uint32_t        DCS3CPTRSET __attribute__((section("sfrs"),address(0xBF811348)));
extern volatile uint32_t        DCH3CPTRINV __attribute__((section("sfrs"),address(0xBF81134C)));
extern volatile uint32_t        DCS3CPTRINV __attribute__((section("sfrs"),address(0xBF81134C)));
#define DCH3DAT DCH3DAT
extern volatile uint32_t   DCH3DAT __attribute__((section("sfrs"), address(0xBF811350)));
typedef struct {
  uint32_t CHPDAT:16;
} __DCH3DATbits_t;
extern volatile __DCH3DATbits_t DCH3DATbits __asm__ ("DCH3DAT") __attribute__((section("sfrs"), address(0xBF811350)));
extern volatile uint32_t        DCH3DATCLR __attribute__((section("sfrs"),address(0xBF811354)));
extern volatile uint32_t        DCH3DATSET __attribute__((section("sfrs"),address(0xBF811358)));
extern volatile uint32_t        DCH3DATINV __attribute__((section("sfrs"),address(0xBF81135C)));
#define DCH4CON DCH4CON
extern volatile uint32_t   DCH4CON __attribute__((section("sfrs"), address(0xBF811360)));
typedef struct {
  uint32_t CHPRI:2;
  uint32_t CHEDET:1;
  uint32_t :1;
  uint32_t CHAEN:1;
  uint32_t CHCHN:1;
  uint32_t CHAED:1;
  uint32_t CHEN:1;
  uint32_t CHCHNS:1;
  uint32_t :2;
  uint32_t CHPATLEN:1;
  uint32_t :1;
  uint32_t CHPIGNEN:1;
  uint32_t :1;
  uint32_t CHBUSY:1;
  uint32_t :8;
  uint32_t CHPIGN:8;
} __DCH4CONbits_t;
extern volatile __DCH4CONbits_t DCH4CONbits __asm__ ("DCH4CON") __attribute__((section("sfrs"), address(0xBF811360)));
extern volatile uint32_t        DCH4CONCLR __attribute__((section("sfrs"),address(0xBF811364)));
extern volatile uint32_t        DCH4CONSET __attribute__((section("sfrs"),address(0xBF811368)));
extern volatile uint32_t        DCH4CONINV __attribute__((section("sfrs"),address(0xBF81136C)));
#define DCH4ECON DCH4ECON
extern volatile uint32_t   DCH4ECON __attribute__((section("sfrs"), address(0xBF811370)));
typedef struct {
  uint32_t :3;
  uint32_t AIRQEN:1;
  uint32_t SIRQEN:1;
  uint32_t PATEN:1;
  uint32_t CABORT:1;
  uint32_t CFORCE:1;
  uint32_t CHSIRQ:8;
  uint32_t CHAIRQ:8;
} __DCH4ECONbits_t;
extern volatile __DCH4ECONbits_t DCH4ECONbits __asm__ ("DCH4ECON") __attribute__((section("sfrs"), address(0xBF811370)));
extern volatile uint32_t        DCH4ECONCLR __attribute__((section("sfrs"),address(0xBF811374)));
extern volatile uint32_t        DCH4ECONSET __attribute__((section("sfrs"),address(0xBF811378)));
extern volatile uint32_t        DCH4ECONINV __attribute__((section("sfrs"),address(0xBF81137C)));
#define DCH4INT DCH4INT
extern volatile uint32_t   DCH4INT __attribute__((section("sfrs"), address(0xBF811380)));
typedef struct {
  uint32_t CHERIF:1;
  uint32_t CHTAIF:1;
  uint32_t CHCCIF:1;
  uint32_t CHBCIF:1;
  uint32_t CHDHIF:1;
  uint32_t CHDDIF:1;
  uint32_t CHSHIF:1;
  uint32_t CHSDIF:1;
  uint32_t :8;
  uint32_t CHERIE:1;
  uint32_t CHTAIE:1;
  uint32_t CHCCIE:1;
  uint32_t CHBCIE:1;
  uint32_t CHDHIE:1;
  uint32_t CHDDIE:1;
  uint32_t CHSHIE:1;
  uint32_t CHSDIE:1;
} __DCH4INTbits_t;
extern volatile __DCH4INTbits_t DCH4INTbits __asm__ ("DCH4INT") __attribute__((section("sfrs"), address(0xBF811380)));
extern volatile uint32_t        DCH4INTCLR __attribute__((section("sfrs"),address(0xBF811384)));
extern volatile uint32_t        DCH4INTSET __attribute__((section("sfrs"),address(0xBF811388)));
extern volatile uint32_t        DCH4INTINV __attribute__((section("sfrs"),address(0xBF81138C)));
#define DCH4SSA DCH4SSA
extern volatile uint32_t   DCH4SSA __attribute__((section("sfrs"), address(0xBF811390)));
typedef struct {
  uint32_t CHSSA:32;
} __DCH4SSAbits_t;
extern volatile __DCH4SSAbits_t DCH4SSAbits __asm__ ("DCH4SSA") __attribute__((section("sfrs"), address(0xBF811390)));
extern volatile uint32_t        DCH4SSACLR __attribute__((section("sfrs"),address(0xBF811394)));
extern volatile uint32_t        DCH4SSASET __attribute__((section("sfrs"),address(0xBF811398)));
extern volatile uint32_t        DCH4SSAINV __attribute__((section("sfrs"),address(0xBF81139C)));
#define DCH4DSA DCH4DSA
extern volatile uint32_t   DCH4DSA __attribute__((section("sfrs"), address(0xBF8113A0)));
typedef struct {
  uint32_t CHDSA:32;
} __DCH4DSAbits_t;
extern volatile __DCH4DSAbits_t DCH4DSAbits __asm__ ("DCH4DSA") __attribute__((section("sfrs"), address(0xBF8113A0)));
extern volatile uint32_t        DCH4DSACLR __attribute__((section("sfrs"),address(0xBF8113A4)));
extern volatile uint32_t        DCH4DSASET __attribute__((section("sfrs"),address(0xBF8113A8)));
extern volatile uint32_t        DCH4DSAINV __attribute__((section("sfrs"),address(0xBF8113AC)));
#define DCH4SSIZ DCH4SSIZ
extern volatile uint32_t   DCH4SSIZ __attribute__((section("sfrs"), address(0xBF8113B0)));
typedef struct {
  uint32_t CHSSIZ:16;
} __DCH4SSIZbits_t;
extern volatile __DCH4SSIZbits_t DCH4SSIZbits __asm__ ("DCH4SSIZ") __attribute__((section("sfrs"), address(0xBF8113B0)));
extern volatile uint32_t        DCH4SSIZCLR __attribute__((section("sfrs"),address(0xBF8113B4)));
extern volatile uint32_t        DCH4SSIZSET __attribute__((section("sfrs"),address(0xBF8113B8)));
extern volatile uint32_t        DCH4SSIZINV __attribute__((section("sfrs"),address(0xBF8113BC)));
#define DCH4DSIZ DCH4DSIZ
extern volatile uint32_t   DCH4DSIZ __attribute__((section("sfrs"), address(0xBF8113C0)));
typedef struct {
  uint32_t CHDSIZ:16;
} __DCH4DSIZbits_t;
extern volatile __DCH4DSIZbits_t DCH4DSIZbits __asm__ ("DCH4DSIZ") __attribute__((section("sfrs"), address(0xBF8113C0)));
extern volatile uint32_t        DCH4DSIZCLR __attribute__((section("sfrs"),address(0xBF8113C4)));
extern volatile uint32_t        DCH4DSIZSET __attribute__((section("sfrs"),address(0xBF8113C8)));
extern volatile uint32_t        DCH4DSIZINV __attribute__((section("sfrs"),address(0xBF8113CC)));
#define DCH4SPTR DCH4SPTR
extern volatile uint32_t   DCH4SPTR __attribute__((section("sfrs"), address(0xBF8113D0)));
typedef struct {
  uint32_t CHSPTR:16;
} __DCH4SPTRbits_t;
extern volatile __DCH4SPTRbits_t DCH4SPTRbits __asm__ ("DCH4SPTR") __attribute__((section("sfrs"), address(0xBF8113D0)));
extern volatile uint32_t        DCH4SPTRCLR __attribute__((section("sfrs"),address(0xBF8113D4)));
extern volatile uint32_t        DCH4SPTRSET __attribute__((section("sfrs"),address(0xBF8113D8)));
extern volatile uint32_t        DCH4SPTRINV __attribute__((section("sfrs"),address(0xBF8113DC)));
#define DCH4DPTR DCH4DPTR
extern volatile uint32_t   DCH4DPTR __attribute__((section("sfrs"), address(0xBF8113E0)));
typedef struct {
  uint32_t CHDPTR:16;
} __DCH4DPTRbits_t;
