Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.1.98/include/proc/p32mz1064daa288.h
#define _DDRCMD28_BNKADDRCMD_POSITION            0x00000008
#define _DDRCMD28_BNKADDRCMD_MASK                0x00000700
#define _DDRCMD28_BNKADDRCMD_LENGTH              0x00000003

#define _DDRCMD28_WAIT_POSITION                  0x0000000B
#define _DDRCMD28_WAIT_MASK                      0x000FF800
#define _DDRCMD28_WAIT_LENGTH                    0x00000009

#define _DDRCMD29_MDADDRHCMD_POSITION            0x00000000
#define _DDRCMD29_MDADDRHCMD_MASK                0x000000FF
#define _DDRCMD29_MDADDRHCMD_LENGTH              0x00000008

#define _DDRCMD29_BNKADDRCMD_POSITION            0x00000008
#define _DDRCMD29_BNKADDRCMD_MASK                0x00000700
#define _DDRCMD29_BNKADDRCMD_LENGTH              0x00000003

#define _DDRCMD29_WAIT_POSITION                  0x0000000B
#define _DDRCMD29_WAIT_MASK                      0x000FF800
#define _DDRCMD29_WAIT_LENGTH                    0x00000009

#define _DDRCMD210_MDADDRHCMD_POSITION           0x00000000
#define _DDRCMD210_MDADDRHCMD_MASK               0x000000FF
#define _DDRCMD210_MDADDRHCMD_LENGTH             0x00000008

#define _DDRCMD210_BNKADDRCMD_POSITION           0x00000008
#define _DDRCMD210_BNKADDRCMD_MASK               0x00000700
#define _DDRCMD210_BNKADDRCMD_LENGTH             0x00000003

#define _DDRCMD210_WAIT_POSITION                 0x0000000B
#define _DDRCMD210_WAIT_MASK                     0x000FF800
#define _DDRCMD210_WAIT_LENGTH                   0x00000009

#define _DDRCMD211_MDADDRHCMD_POSITION           0x00000000
#define _DDRCMD211_MDADDRHCMD_MASK               0x000000FF
#define _DDRCMD211_MDADDRHCMD_LENGTH             0x00000008

#define _DDRCMD211_BNKADDRCMD_POSITION           0x00000008
#define _DDRCMD211_BNKADDRCMD_MASK               0x00000700
#define _DDRCMD211_BNKADDRCMD_LENGTH             0x00000003

#define _DDRCMD211_WAIT_POSITION                 0x0000000B
#define _DDRCMD211_WAIT_MASK                     0x000FF800
#define _DDRCMD211_WAIT_LENGTH                   0x00000009

#define _DDRCMD212_MDADDRHCMD_POSITION           0x00000000
#define _DDRCMD212_MDADDRHCMD_MASK               0x000000FF
#define _DDRCMD212_MDADDRHCMD_LENGTH             0x00000008

#define _DDRCMD212_BNKADDRCMD_POSITION           0x00000008
#define _DDRCMD212_BNKADDRCMD_MASK               0x00000700
#define _DDRCMD212_BNKADDRCMD_LENGTH             0x00000003

#define _DDRCMD212_WAIT_POSITION                 0x0000000B
#define _DDRCMD212_WAIT_MASK                     0x000FF800
#define _DDRCMD212_WAIT_LENGTH                   0x00000009

#define _DDRCMD213_MDADDRHCMD_POSITION           0x00000000
#define _DDRCMD213_MDADDRHCMD_MASK               0x000000FF
#define _DDRCMD213_MDADDRHCMD_LENGTH             0x00000008

#define _DDRCMD213_BNKADDRCMD_POSITION           0x00000008
#define _DDRCMD213_BNKADDRCMD_MASK               0x00000700
#define _DDRCMD213_BNKADDRCMD_LENGTH             0x00000003

#define _DDRCMD213_WAIT_POSITION                 0x0000000B
#define _DDRCMD213_WAIT_MASK                     0x000FF800
#define _DDRCMD213_WAIT_LENGTH                   0x00000009

#define _DDRCMD214_MDADDRHCMD_POSITION           0x00000000
#define _DDRCMD214_MDADDRHCMD_MASK               0x000000FF
#define _DDRCMD214_MDADDRHCMD_LENGTH             0x00000008

#define _DDRCMD214_BNKADDRCMD_POSITION           0x00000008
#define _DDRCMD214_BNKADDRCMD_MASK               0x00000700
#define _DDRCMD214_BNKADDRCMD_LENGTH             0x00000003

#define _DDRCMD214_WAIT_POSITION                 0x0000000B
#define _DDRCMD214_WAIT_MASK                     0x000FF800
#define _DDRCMD214_WAIT_LENGTH                   0x00000009

#define _DDRCMD215_MDADDRHCMD_POSITION           0x00000000
#define _DDRCMD215_MDADDRHCMD_MASK               0x000000FF
#define _DDRCMD215_MDADDRHCMD_LENGTH             0x00000008

#define _DDRCMD215_BNKADDRCMD_POSITION           0x00000008
#define _DDRCMD215_BNKADDRCMD_MASK               0x00000700
#define _DDRCMD215_BNKADDRCMD_LENGTH             0x00000003

#define _DDRCMD215_WAIT_POSITION                 0x0000000B
#define _DDRCMD215_WAIT_MASK                     0x000FF800
#define _DDRCMD215_WAIT_LENGTH                   0x00000009

#define _DDRSCLSTART_SCLLBPASS_POSITION          0x00000000
#define _DDRSCLSTART_SCLLBPASS_MASK              0x00000001
#define _DDRSCLSTART_SCLLBPASS_LENGTH            0x00000001

#define _DDRSCLSTART_SCLUBPASS_POSITION          0x00000001
#define _DDRSCLSTART_SCLUBPASS_MASK              0x00000002
#define _DDRSCLSTART_SCLUBPASS_LENGTH            0x00000001

#define _DDRSCLSTART_SCLEN_POSITION              0x0000001A
#define _DDRSCLSTART_SCLEN_MASK                  0x04000000
#define _DDRSCLSTART_SCLEN_LENGTH                0x00000001

#define _DDRSCLSTART_SCLSTART_POSITION           0x0000001C
#define _DDRSCLSTART_SCLSTART_MASK               0x10000000
#define _DDRSCLSTART_SCLSTART_LENGTH             0x00000001

#define _DDRSCLSTART_SCLPHCAL_POSITION           0x0000001D
#define _DDRSCLSTART_SCLPHCAL_MASK               0x20000000
#define _DDRSCLSTART_SCLPHCAL_LENGTH             0x00000001

#define _DDRSCLLAT_CAPCLKDLY_POSITION            0x00000000
#define _DDRSCLLAT_CAPCLKDLY_MASK                0x0000000F
#define _DDRSCLLAT_CAPCLKDLY_LENGTH              0x00000004

#define _DDRSCLLAT_DDRCLKDLY_POSITION            0x00000004
#define _DDRSCLLAT_DDRCLKDLY_MASK                0x000000F0
#define _DDRSCLLAT_DDRCLKDLY_LENGTH              0x00000004

#define _DDRSCLCFG0_BURST8_POSITION              0x00000000
#define _DDRSCLCFG0_BURST8_MASK                  0x00000001
#define _DDRSCLCFG0_BURST8_LENGTH                0x00000001

#define _DDRSCLCFG0_DDR2_POSITION                0x00000001
#define _DDRSCLCFG0_DDR2_MASK                    0x00000002
#define _DDRSCLCFG0_DDR2_LENGTH                  0x00000001

#define _DDRSCLCFG0_RCASLAT_POSITION             0x00000004
#define _DDRSCLCFG0_RCASLAT_MASK                 0x000000F0
#define _DDRSCLCFG0_RCASLAT_LENGTH               0x00000004

#define _DDRSCLCFG0_ODTCSW_POSITION              0x00000018
#define _DDRSCLCFG0_ODTCSW_MASK                  0x01000000
#define _DDRSCLCFG0_ODTCSW_LENGTH                0x00000001

#define _DDRSCLCFG1_SCLCSEN_POSITION             0x00000000
#define _DDRSCLCFG1_SCLCSEN_MASK                 0x00000001
#define _DDRSCLCFG1_SCLCSEN_LENGTH               0x00000001

